Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType
An enumerated type describing where an ancillary is used on a fabrication part.
Since:
2017 Subscription Update
Since:
2017 Subscription Update

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Stiffener
Ancillary makes up a fabrication part internal or external stiffener.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Hanger
Ancillary makes up a fabrication part hanger.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Airturn
Ancillary makes up a fabrication part airturn or vane.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Splitter
Ancillary makes up a fabrication part splitter.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Seam
Ancillary is associated with a seam on development(s).

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Connector
Ancillary makes up a fabrication part connector.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Loose
Miscellaneous loose ancillary defined on the part.

Autodesk.Revit.DB.Fabrication.FabricationAncillaryUsageType.Undefined
Undefined usage.